<template>
  <main>
    <section>
      <el-backtop></el-backtop>
    </section>
    <div>
      <h3>{{ title }}</h3>
      <div v-html="html"></div>
    </div>
  </main>
</template>

<script>
export default {
  name: "serviceAgreement",
  data() {
    return {
      title: "洛阳软件公共服务用户服务协议",
      html: '<p>&nbsp;&nbsp;&nbsp;&nbsp;感谢您注册并使用洛阳市软件公共服务平台，洛阳市软件公共服务平台（以下简称“本平台”）根据洛阳市软件公共服务平台《用户服务协议》（以下简称“本协议”）为您提供服务。您点击平台页面上的“已阅读并同意协议（具体措辞详见注册页面）”或您进行注册、使用、获取用户账号、登录及使用相关服务的行为或者以其他任何明示或者默示方式表示接受本协议的，均视为您已阅读并同意签署本协议，本协议即构成对您和本平台有约束力的法律文件。如果您不同意本协议的条款，请停止注册、登录及使用本平台服务。</p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;为使用本平台服务，请您务必审慎阅读、充分理解本协议各条款内容，特别是免除或者限制责任的条款、对用户权利进行限制的条款等。限制、免责条款或者其他涉及您重大权益的条款可能以加粗形式提示您重点注意。如果您不接受相关条款，您应当立即停止使用本服务，注销平台账号。&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>【特别声明】：</p><p>&nbsp;</p><p>您有违反本协议的任何行为时，本平台有权根据您违反约定的情形单方采取限制、中止或终止向您提供服务等措施，并有权追究您相关责任。</p><p>&nbsp;</p><p>一、定义与解释</p><p>&nbsp;</p><p>1.1&nbsp;用户是指注册、登录、使用本平台服务的个人或组织，在本协议中更多地称为“您”。&nbsp;</p><p>&nbsp;</p><p>1.2&nbsp;本平台是向用户提供用户注册、用户登录、实名核验以及与此相关的身份认证技术服务的平台。&nbsp;</p><p>&nbsp;</p><p>二、协议适用范围</p><p>&nbsp;</p><p>2.1&nbsp;本协议是本平台制定的关于获取和使用本平台账号的相关规则。本规则适用于由本平台提供的需要注册或使用本平台账号的全部软件或服务。&nbsp;</p><p>&nbsp;</p><p>2.2&nbsp;本协议项下的登录服务包括但不限于以下情况：平台向用户提供的通过平台注册账号登录使用；平台向用户提供的通过第三方账号登录使用。</p><p>&nbsp;</p><p>&nbsp;2.3&nbsp;您通过本平台提供的账号使用相关的软件和服务时，须同时遵守各项服务的单独协议。&nbsp;</p><p>&nbsp;</p><p>三、账号注册及管理</p><p>&nbsp;</p><p>3.1&nbsp;账号注册&nbsp;</p><p>&nbsp;</p><p>3.1.1&nbsp;您在注册及使用本平台服务时，必须向本平台提供真实、准确、完整、合法有效的资料，且有义务维持并及时更新您的资料。其中，根据实名认证方式的不同，个人所需提供的实名认证资料包括但不限于姓名、身份证信息、人脸生物信息等。企业需要提供的实名认证资料包括但不限于统一信用代码信息、企业法定代表人姓名及其身份证件信息、经办人手机号及身份证件信息等。若本平台有合理理由怀疑您提供的身份信息及相关资料错误、不实、过时或不完整的，本平台有权限制或停止向您提供部分或全部服务，您同时须承担因此引起的相应责任及后果。&nbsp;</p><p>&nbsp;</p><p>3.1.2&nbsp;您不得冒用他人名义申请非本人的用户账号。如有违反，经核实后，本平台或第三方服务平台有权删除其账号。对于冒用他人名义申请非本人的用户账号而引起的一切责任，由冒用者承担。&nbsp;</p><p>&nbsp;</p><p>3.1.3&nbsp;若您为个人用户，您确认并授权，本平台有权要求核对您的有效身份信息，并留存有效必要文件，您应积极配合，否则本平台有权限制或停止向您提供部分或全部服务。&nbsp;</p><p>&nbsp;</p><p>3.2&nbsp;账号管理&nbsp;</p><p>&nbsp;</p><p>3.2.1本平台的用户包括个人用户和法人用户（在本平台注册的法人包括企业法人、机关事业单位法人、社会团体法人及其他组织，注册时请根据实际情况在平台注册页面选择相应的类型）。&nbsp;</p><p>&nbsp;</p><p>3.2.2&nbsp;您有责任妥善保管注册账号信息及账号密码的安全，避免使用过于简单的密码。您需要对您注册账号以及密码下的行为承担法律责任。</p><p>&nbsp;</p><p>3.2.3&nbsp;您确认只有您本人可以使用您的账号。用户账号和密码不得出借、转让、继承或者赠与。因非本平台原因导致用户的账号、密码遗失、遗忘或被他人窃取的，本平台不承担责任。在您决定不再使用该账号时，您应向本平台申请注销该账号。您应对因您未能遵守本款约定而发生的任何损失、损毁及其他不利后果负责。&nbsp;</p><p>&nbsp;</p><p>3.2.4&nbsp;如果您当前使用的账号并不是您初始申请注册的或者不是通过本平台提供的其他途径获得的，您不得用该号码登录或进行任何操作，并请您在第一时间通知本平台，若由于您未及时通知本平台且违规操作所产生一切的不利后果，将由您承担全部责任。&nbsp;</p><p>&nbsp;</p><p>3.2.5&nbsp;如您违反相关法律法规、本规则或其他相关协议、规则，本平台有权限制、中止、冻结或终止您对账号的使用，且根据实际情况决定是否恢复您对账号的使用，而由此产生的损失由您自行承担。&nbsp;</p><p>&nbsp;</p><p>四、用户行为规范</p><p>&nbsp;</p><p>4.1&nbsp;您不得因非正常使用服务之目的恶意注册、获取本平台账号。若经过本平台判断，认为您使用的账号是恶意注册、获取的号码，本平台有权对相应账号采取限制、中止或终止使用等措施。&nbsp;</p><p>&nbsp;</p><p>4.2&nbsp;您在使用本服务时，须通过本平台提供的技术接口、登录页面及其他合法通道等进行平台或第三方账号和密码输入、个人信息授权等操作；否则，可能造成的账号、密码泄漏或其他损失等由您自行承担。&nbsp;</p><p>&nbsp;</p><p>4.3&nbsp;第三方负责其提供的具体网站、应用或其他服务的合法性、安全性以及真实性，若因任何第三方原因，造成您损失的，由第三方承担全部责任。&nbsp;</p><p>&nbsp;</p><p>4.4&nbsp;您通过本服务使用平台或第三方账号登录、使用的网站、应用或服务等，应遵循您与第三方之间的协议、约定或第三方相关的规则等，若您与第三方就相关协议、约定、规则等产生分歧，由您与第三方协商或其他合法途径解决。&nbsp;</p><p>&nbsp;</p><p>4.5&nbsp;您理解并同意：本平台在服务中仅提供了登录接口的技术服务，您通过本服务使用平台或第三方账号登录、使用的网站、应用或服务等，均是由第三方提供的。第三方可能并非本平台的合作机构或与本平台有任何联系，除非本平台已经明确声明与第三方有合作关系，否则第三方网站、应用或服务等的质量和安全等由第三方独立负责、承担，并不视为本平台同意、推荐、认可、保证第三方提供的服务，请您自行进行判断、甄别，并自行承担相关损失、责任。若您因使用第三方网站、应用或服务等产生的任何纠纷，您应与第三方通过协商或其他合法途径解决。&nbsp;</p><p>&nbsp;</p><p>4.6&nbsp;您在使用平台提供的服务过程中，必须遵循法律法规、规章、规范性文件及政策要求的规定，遵守所有与平台、网络服务有关的网络协议、规定和程序，并不得利用本平台从事以下行为：&nbsp;</p><p>&nbsp;</p><p>（1）发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容；&nbsp;&nbsp;</p><p>（2）发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；&nbsp;</p><p>&nbsp;</p><p>（3）虚构事实、隐瞒真相以误导、欺骗他人；&nbsp;</p><p>&nbsp;</p><p>（4）发表、传送、传播广告信息及垃圾信息；&nbsp;</p><p>&nbsp;</p><p>（5）&nbsp;利用平台传输、发布违反国家法律法规政策的任何内容（信息）、涉及国家秘密和/或安全的信息、防碍互联网运行安全的信息；侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容、任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料等，且不得为他人实施上述行为提供任何便利；&nbsp;</p><p>&nbsp;</p><p>（6）以任何技术手段或其他方式干扰平台网上服务系统的正常运行，或干扰其他用户对平台服务的使用；&nbsp;</p><p>&nbsp;</p><p>（7）通过任何方式搜集本平台服务中其他用户的用户名、电子邮件等相关信息，并以发送垃圾邮件、连锁邮件、垃圾短信、即时消息等方式干扰、骚扰其他用户；&nbsp;</p><p>&nbsp;</p><p>（8）从事其他违反法律法规、政策及公序良俗、社会公德等的行为或对互联网的正常运转造成不利影响的行为。&nbsp;</p><p>&nbsp;</p><p>4.7&nbsp;本平台服务仅供注册用户使用，除非经本平台书面许可，您不得进行以下行为：&nbsp;</p><p>&nbsp;</p><p>（1）通过本平台发布包含广告、宣传、促销等内容的信息；&nbsp;</p><p>&nbsp;</p><p>（2）将本平台提供的服务再次许可他人使用；&nbsp;</p><p>&nbsp;</p><p>（3）其他超出本平台正常服务功能之外的行为。&nbsp;</p><p>&nbsp;</p><p>4.8&nbsp;您充分了解并同意，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容、您进行的各项操作、您进行的授权以及由此产生的任何后果。&nbsp;</p><p>&nbsp;</p><p>4.9&nbsp;如果本平台发现或收到他人举报您发布的信息违反前述约定或本协议其他约定的，本平台有权进行独立判断并采取技术手段予以删除、屏蔽或断开相关的信息链接。同时，本平台有权视您的行为性质，采取包括但不限于暂停或终止本服务、追究法律责任等措施。本平台有权判断用户的行为是否符合平台服务条款规定的权利，如果本平台认为用户违背了本协议、法律法规政策等规定，本平台有权随时变更、中断或终止部分或全部服务的权利，且无需事先告知。&nbsp;</p><p>&nbsp;</p><p>五、知识产权声明</p><p>&nbsp;</p><p>5.1&nbsp;本平台在服务中提供的任何软件、网站、商业标识、版面设计、排版方式、文字、图片、图形、音频、视频、有关数据等内容、功能和服务的著作权、商标权、专利权、商业秘密等知识产权均受中华人民共和国法律法规和相应的国际条约保护，本平台所有者或技术支持方享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。&nbsp;</p><p>&nbsp;</p><p>5.2&nbsp;您在使用本平台的过程中，可能会使用到由第三方开发的在本平台运行的功能、软件或服务，用户除遵守本协议相关规定以外，还应遵守第三方相关规定，并尊重第三方权利人对其功能、软件、服务及其所包含内容的相关权利。&nbsp;</p><p>&nbsp;</p><p>5.3&nbsp;未经本平台或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。&nbsp;</p><p>&nbsp;</p><p>六、第三方提供的服务</p><p>&nbsp;</p><p>6.1&nbsp;本服务可能会使用第三方软件或技术，这种使用已经获得合法授权，您对本协议的签署及继续使用行为视为对接受第三方软件或技术服务的认可。&nbsp;</p><p>&nbsp;</p><p>6.2如因本平台使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，您使用本平台上提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务或用户协议。本平台和第三方之间对出现的纠纷在法律规定和约定的范围内各自承担责任。&nbsp;</p><p>&nbsp;</p><p>七、风险及免责</p><p>&nbsp;</p><p>7.1&nbsp;您理解并同意：为了向您提供有效的服务，本服务会利用您终端设备的处理器和带宽等资源。在使用本平台过程中可能产生数据流量的费用，您需自行向运营商了解相关资费信息，并自行承担相关费用。&nbsp;&nbsp;</p><p>&nbsp;</p><p>7.2&nbsp;您在使用本平台提供的服务时，须自行承担如下本平台不可掌控的风险内容，包括但不限于：&nbsp;</p><p>&nbsp;</p><p>（1）由于受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏等不可抗拒因素可能引起的信息丢失、泄漏等风险；&nbsp;</p><p>&nbsp;</p><p>（2）&nbsp;用户的电脑软件、系统、硬件和通信线路出现故障；&nbsp;</p><p>&nbsp;</p><p>（3）用户操作不当或通过非本平台授权的方式使用本服务；&nbsp;</p><p>&nbsp;</p><p>（4）&nbsp;用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；&nbsp;</p><p>&nbsp;</p><p>（5）&nbsp;由于网络信号不稳定等原因，所引起的登录失败、资料同步不完整、页面打开速度慢等风险；&nbsp;</p><p>&nbsp;</p><p>（6）&nbsp;其他本平台无法控制或合理预见的情形。&nbsp;</p><p>&nbsp;</p><p>7.3&nbsp;因您的过错导致的任何损失由您自行承担，该过错包括但不限于：不按照提示操作，未及时进行操作，遗忘或泄漏密码、校验码等，密码被他人破解，您使用的计算机或其他硬件、终端等被他人侵入或丢失，或您使用的软件被他人侵入，或者您的个人生物识别信息被他人利用。&nbsp;</p><p>&nbsp;</p><p>7.4&nbsp;您理解并同意，因业务发展需要，本平台有权在提前告知的前提下，对本平台的全部或部分服务内容进行变更、暂停、限制、终止或撤销。&nbsp;</p><p>&nbsp;</p><p>7.5&nbsp;本平台会根据您选择的服务类型向您提供相应的服务。您理解并同意，本平台有权选择提供服务或开展合作的对象，有权决定功能开放、数据接口和相关数据披露的对象和范围，并有权视具体情况中止或终止向存有包括但不限于以下情形的用户提供本服务：&nbsp;</p><p>&nbsp;</p><p>（1）违反法律法规或本协议规定的；&nbsp;</p><p>&nbsp;</p><p>（2）影响使用者体验的；&nbsp;</p><p>&nbsp;</p><p>（3）存在安全隐患的；&nbsp;</p><p>&nbsp;</p><p>（4）违背本服务运营原则，或不符合本平台其他管理要求的。&nbsp;</p><p>&nbsp;</p><p>7.6&nbsp;由于互联网本身所具有的不稳定性，本平台无法保证服务不会中断。系统因有关状况无法正常运作，使用户无法使用服务或使用服务受到任何影响时，本平台对用户或第三方不负任何责任，前述状况包括但不限于：&nbsp;</p><p>&nbsp;</p><p>（1）本平台系统停机维护期间。&nbsp;</p><p>&nbsp;</p><p>（2）电信设备出现故障不能进行数据传输的。&nbsp;</p><p>&nbsp;</p><p>（3）由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或延迟。&nbsp;</p><p>&nbsp;</p><p>（4）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的。&nbsp;</p><p>&nbsp;</p><p>八、法律责任</p><p>&nbsp;</p><p>8.1&nbsp;您理解并同意，本平台有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何人士采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。&nbsp;</p><p>&nbsp;</p><p>8.2&nbsp;您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；本平台因此遭受损失的，您也应当一并赔偿。&nbsp;</p><p>&nbsp;</p><p>九、&nbsp;协议的更新、变更</p><p>&nbsp;</p><p>9.1&nbsp;协议的更新&nbsp;</p><p>&nbsp;</p><p>本协议内容同时包括本平台可能不定期发布的关于本服务的相关协议、服务声明、业务规则及公告指引等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，请同样遵守。否则，请立即停止使用本服务。&nbsp;</p><p>&nbsp;</p><p>9.2&nbsp;协议的变更&nbsp;</p><p>&nbsp;</p><p>您使用本服务即视为您已阅读并同意受本协议的约束。本平台有权在必要时修改本协议条款。您在享受各项服务时，可以在相关页面中查阅最新的协议条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务，注销平台账号、停止使用本服务。&nbsp;</p><p>&nbsp;</p><p>9.3&nbsp;协议的签署形式&nbsp;</p><p>&nbsp;</p><p>如您对本协议条款内容有任何疑问，可向平台客服咨询。一旦点击“同意”或“接受”或“注册”按钮并成功注册，则与本平台之间形成协议关系，应当受本协议条款的约束。&nbsp;</p><p>&nbsp;</p><p>十、&nbsp;法律适用及管辖</p><p>&nbsp;</p><p>10.1&nbsp;本协议的签订地为洛阳市西工区。</p><p>&nbsp;</p><p>10.2&nbsp;本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用中华人民共和国法律。&nbsp;</p><p>&nbsp;</p><p>10.3&nbsp;如因本协议或本服务所引起或与其有关的任何争议应向本协议签订地人民法院诉讼解决。&nbsp;</p><p>&nbsp;</p><p>十一、&nbsp;其他</p><p>&nbsp;</p><p>11.1&nbsp;本协议自您同意勾选注册、登录使用之日（以日期最早的为准）起生效，除非本平台终止本协议或者您丧失本平台用户资格，否则本协议始终有效。本协议终止并不免除用户根据本协议或其他有关协议、规则所应承担的义务和责任。&nbsp;</p><p>&nbsp;</p><p>11.2&nbsp;本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>',
    }
  }
}
</script>

<style scoped lang="scss">
main {
  padding-top: 1.5rem;

  > div {
    max-width: 9.6rem;
    width: 98%;
    margin: 0 auto;
    background-color: #FFFFFF;
    border-radius: 10px;
    padding: .6rem .4rem;

    h3{
      text-align: center;
      margin-bottom: .4rem;
      font-size: 22px;
    }
    >div{
      line-height: 20px;
    }
  }
}
</style>
